In [59]:
import pandas as pd

In [60]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### How many movies are listed in the titles dataframe?

In [80]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [62]:
cast = pd.read_csv('release_dates.csv')
cast.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [63]:
print("Total number of movies listed in the dataframe are:")
len(titles)

Total number of movies listed in the dataframe are:

244914

### What are the earliest two films listed in the titles dataframe?

In [64]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [65]:
print("Total number of movies with title Hamlet are:")
len(titles[titles['title']=='Hamlet'])

Total number of movies with title Hamlet are:

20

### How many movies are titled "North by Northwest"?

In [66]:
print("Total number of movies with title North by Northwest are:")
len(titles[titles['title']=='North by Northwest'])

Total number of movies with title North by Northwest are:

1

### When was the first movie titled "Hamlet" made?

In [67]:
print("The first movie titled Hamlet was made in the following year:")
titles[titles['title']=='Hamlet'].sort_values(by=['year']).head(1).year

The first movie titled Hamlet was made in the following year:

52521    1910
Name: year, dtype: int64

### List all of the "Treasure Island" movies from earliest to most recent.

In [68]:
print("List of all Treasure Island movies form earliest to most recent are:")
titles[titles['title']=='Treasure Island'].sort_values(by=['year'])

List of all Treasure Island movies form earliest to most recent are:

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [69]:
print("Total number of movies made in the year 1950 are:")
len(titles[titles['year']==1950])

Total number of movies made in the year 1950 are:

1113

### How many movies were made in the year 1960?

In [70]:
print("Total number of movies made in the year 1960 are:")
len(titles[titles['year']==1960])

Total number of movies made in the year 1960 are:

1549

### How many movies were made from 1950 through 1959?

In [71]:
print("Total number of movies made from 1950 to 1959 are:")
len(titles[(titles['year']>=1950)&(titles['year']<=1959)])

Total number of movies made from 1950 to 1959 are:

12934

### In what years has a movie titled "Batman" been released?

In [72]:
print("The years in which movie titled Batman has been released are:")
(titles[titles['title']=='Batman']).year

The years in which movie titled Batman has been released are:

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [73]:
print("The number of roles in the movie Inception are:")
print(len(cast[cast['title']=='Inception']))
print("The roles are displayed below:")
cast[cast['title']=='Inception']

The number of roles in the movie Inception are:
63
The roles are displayed below:

            title  year      country        date
173259  Inception  2010        Egypt  2010-07-14
173260  Inception  2010       Kuwait  2010-07-15
173261  Inception  2010     Malaysia  2010-07-15
173262  Inception  2010  Philippines  2010-07-15
173263  Inception  2010    Singapore  2010-07-15
...           ...   ...          ...         ...
173317  Inception  2010    Venezuela  2010-08-13
173318  Inception  2010       Greece  2010-08-24
173319  Inception  2010        China  2010-09-01
173320  Inception  2010     Pakistan  2010-09-11
173321  Inception  2010        Italy  2010-09-24

[63 rows x 4 columns]

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [81]:
print("The number of roles in the movie Inception not ranked by n value are:")
print(len(cast[(cast['title']=='Inception') & (cast['n'].isnull()==True)].type))
print("The roles are displayed below:")
cast[(cast['title']=='Inception') & (cast['n'].isnull()==True)]

The number of roles in the movie Inception not ranked by n value are:
9
The roles are displayed below:

             title  year                     name   type         character   n
98153    Inception  2010     Michael (III) August  actor     LAX Passenger NaN
197877   Inception  2010                 Ken Bhan  actor  Mombasan Gambler NaN
374661   Inception  2010            John Ceallach  actor     LAX Passenger NaN
497161   Inception  2010             Garvin Cross  actor    Snow Commander NaN
684098   Inception  2010            Seve Esposito  actor   Italian Gambler NaN
690634   Inception  2010      Marcus (II) Everett  actor      Stock Broker NaN
707642   Inception  2010  Zachary Christopher Fay  actor             Extra NaN
836295   Inception  2010        Daniel Girondeaud  actor    Bridge Sub Con NaN
1006636  Inception  2010          Andrew Hoagland  actor        Pedestrian NaN

### But how many roles in the movie "Inception" did receive an "n" value?

In [82]:
print("The number of roles in the movie Inception with n value are:")
print(len(cast[(cast['title']=='Inception')&(cast['n'].isnull()==False)].type))
print("The roles are displayed below:")
cast[(cast['title']=='Inception')&(cast['n'].isnull()==False)]

The number of roles in the movie Inception with n value are:
19
The roles are displayed below:

,title,year,name,type,character,n
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
326745,Inception,2010,Michael Caine,actor,Miles,11.0
333415,Inception,2010,Earl Cameron,actor,Elderly Bald Man,20.0
433867,Inception,2010,Nicolas Clerc,actor,Bridge Sub Con,26.0
444385,Inception,2010,Adam (IV) Cole,actor,Bar Sub Con,34.0
517227,Inception,2010,Jean-Michel Dagory,actor,Bridge Sub Con,30.0
590576,Inception,2010,Leonardo DiCaprio,actor,Cobb,1.0
709436,Inception,2010,Russ Fega,actor,Cab Driver,23.0
737322,Inception,2010,Mark Fleischmann,actor,Penrose Sub Con,32.0
807795,Inception,2010,Michael Gaston,actor,Immigration Officer,45.0
812135,Inception,2010,Johnathan Geare,actor,James (3 years),17.0
832083,Inception,2010,Carl Gilliard,actor,Lobby Sub Con,40.0
833376,Inception,2010,Jack Gilroy,actor,Old Cobb,50.0
859993,Inception,2010,Joseph Gordon-Levitt,actor,Arthur,2.0
910757,Inception,2010,Lukas Haas,actor,Nash,12.0
940923,Inception,2010,Tom Hardy,actor,Eames,4.0
967176,Inception,2010,Ryan Hayward,actor,Lawyer,21.0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [83]:
print("The cast of North by Northwest in their correct n-value order value with n values are:")
print(cast[(cast['title']=="North by Northwest")&(cast['n'].isnull()==False)].sort_values(by=['n']).name)
print("The cast is displayed below:")
cast[(cast['title']=="North by Northwest")&(cast['n'].isnull()==False)].sort_values(by=['n'])

The cast of North by Northwest in their correct n-value order value with n values are:
871426           Cary Grant
356707       Leo G. Carroll
665768    Robert Ellenstein
464736      Philip Coolidge
206471         Edward Binns
Name: name, dtype: object
The cast is displayed below:

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [84]:
print("The entire cast of 1972 film Seluth order by n value is:")
print((cast[(cast['title']=="Sleuth")&(cast['year']==1972)]).sort_values(by=['n']).name)
print("The entire cast is displayed below:")
cast[(cast['title']=="Sleuth")&(cast['year']==1972)].sort_values(by=['n'])

The entire cast of 1972 film Seluth order by n value is:
326773     Michael Caine
373876    Alec Cawthorne
Name: name, dtype: object
The entire cast is displayed below:

         title  year            name   type          character    n
326773  Sleuth  1972   Michael Caine  actor        Milo Tindle  2.0
373876  Sleuth  1972  Alec Cawthorne  actor  Inspector Doppler  3.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [85]:
print("The entire cast of 2007 film Seluth order by n value is:")
print(cast[(cast['title']=="Sleuth")&(cast['year']==2007)].sort_values(by=['n']).name)
print("The entire cast is displayed below:")
cast[(cast['title']=="Sleuth")&(cast['year']==2007)].sort_values(by=['n'])

The entire cast of 2007 film Seluth order by n value is:
326774          Michael Caine
260242        Kenneth Branagh
373877    Alec (II) Cawthorne
Name: name, dtype: object
The entire cast is displayed below:

         title  year                 name   type          character    n
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [89]:
print("The number of roles that were credited in the silent 1921 version of Hamlet are:")
print(len(cast[(cast['title']=='Hamlet')&(cast['year']==1921)]))
print("The roles are displayed below:")
cast[(cast['title']=='Hamlet')&(cast['year']==1921)]

The number of roles that were credited in the silent 1921 version of Hamlet are:
3
The roles are displayed below:

         title  year              name   type     character    n
7789    Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
458904  Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
555034  Hamlet  1921  Anton De Verdier  actor       Laertes  7.0

### How many roles were credited in Branagh’s 1996 Hamlet?

In [90]:
print("The number of roles that were credited in the Branagh's 1996 Hamlet are:")
print(len(cast[(cast['title']=='Hamlet')&(cast['year']==1996)]))
print("The roles are displayed below:")
cast[(cast['title']=='Hamlet')&(cast['year']==1996)]

The number of roles that were credited in the Branagh's 1996 Hamlet are:
22
The roles are displayed below:

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
344365,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
500916,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
518572,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
576147,Hamlet,1996,G?rard Depardieu,actor,Reynaldo,13.0
598618,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0
604339,Hamlet,1996,Ken Dodd,actor,Yorick,15.0
656817,Hamlet,1996,Rob Edwards,actor,Lucianus,17.0
669232,Hamlet,1996,Jimmy Ellis,actor,Old Fortinbras,NaN
704270,Hamlet,1996,Nicholas Farrell,actor,Horatio,18.0
708468,Hamlet,1996,Ray Fearon,actor,Francisco,19.0
827066,Hamlet,1996,John Gielgud,actor,Priam,21.0
990819,Hamlet,1996,Charlton Heston,actor,Player King,23.0

### How many "Hamlet" roles have been listed in all film credits through history?

In [91]:
print("The number of Hamlet roles that have been listed in all film credits throughout the history are:")
print(len(cast[(cast['title']=='Hamlet')]))
print("The roles are displayed below:")
cast[(cast['title']=='Hamlet')]

The number of Hamlet roles that have been listed in all film credits throughout the history are:
117
The roles are displayed below:

          title  year              name   type              character     n
1731     Hamlet  1996        Riz Abbasi  actor  Attendant to Claudius   1.0
7789     Hamlet  1921  Fritz Achterberg  actor            Fortinbras,   9.0
11728    Hamlet  2009      Hayden Adams  actor                Laertes   7.0
11729    Hamlet  2009      Hayden Adams  actor                 Player   7.0
14493    Hamlet  1913       Eric Adeney  actor               Reynaldo  14.0
...         ...   ...               ...    ...                    ...   ...
1016454  Hamlet  1948  Stanley Holloway  actor            Gravedigger   9.0
1016879  Hamlet  1990          Ian Holm  actor               Polonius   5.0
1024017  Hamlet  1969   Anthony Hopkins  actor               Claudius   3.0
1042708  Hamlet  1964    Barnard Hughes  actor              Marcellus   NaN
1042709  Hamlet  1964    Barnard Hughes  actor                 Priest   NaN

[117 rows x 6 columns]

### How many people have played an "Ophelia"?

In [92]:
print("The number of people who played Ophelia are:")
print(len(cast[cast['character']=='Ophelia']))
print("The names are listed below:")
cast[cast['character']=='Ophelia'].name

The number of people who played Ophelia are:
4
The names are listed below:

248251        Amy Bourque
410247     Josie Chisholm
470859    Crystal Cordero
866334      Lucas Grabeel
Name: name, dtype: object

### How many people have played a role called "The Dude"?

In [93]:
print("The number of people who played The Dude are:")
print(len(cast[cast['character']=='The Dude']))
print("The names are listed below:")
cast[cast['character']=='The Dude'].name

The number of people who played The Dude are:
7
The names are listed below:

272161          Jeff Bridges
339389           Jordan Cann
498660         Scott Crowell
570128        Chris DeMarcus
610791           Mike Donlin
629473        Devin The Dude
855976    Michael D. Goodwin
Name: name, dtype: object

### How many people have played a role called "The Stranger"?

In [94]:
print("The number of people who played The Stranger are:")
print(len(cast[cast['character']=='The Stranger']))
print("The names are listed below:")
cast[cast['character']=='The Stranger'].name

The number of people who played The Stranger are:
84
The names are listed below:

25954      Hassan Mutlag Al-Maraiyeh
35748           Vincent H. Alexander
46418                   Terral Altom
67421                   Tony Anthony
67424                   Tony Anthony
                     ...
980374               Lance Henriksen
994124                     Dan Hicks
1000537                George Hilton
1027457                  Lee Horsley
1034131                Kevin Howarth
Name: name, Length: 84, dtype: object

### How many roles has Sidney Poitier played throughout his career?

In [95]:
print("The number of roles played by Sidney Poitier are:")
print(len(cast[cast['name']=='Sidney Poitier']))
print("The roles are displayed below:")
cast[cast['name']=='Sidney Poitier']

The number of roles played by Sidney Poitier are:
0
The roles are displayed below:

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### How many roles has Judi Dench played?

In [96]:
print("The number of roles played by Judi Dench are:")
print(len(cast[cast['name']=='Judi Dench']))
print("The roles are displayed below:")
cast[cast['name']=='Judi Dench']

The number of roles played by Judi Dench are:
0
The roles are displayed below:

Empty DataFrame
Columns: [title, year, name, type, character, n]
Index: []

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [97]:
print("The list of supporting roles played by Cary Grant in 1940's ordered by year are:")
cast[(cast['name']=='Cary Grant')&(cast['n']==2)&(cast['year']>=1940)&(cast['year']<=1949)].sort_values(by=['year'])

The list of supporting roles played by Cary Grant in 1940's ordered by year are:

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [98]:
print(" List the leading roles that Cary Grant played in the 1940s ordered by year are:")
cast[(cast['name']=='Cary Grant')&(cast['n']==1)&(cast['year']>=1940)&(cast['year']<=1949)].sort_values(by=['year'])

 List the leading roles that Cary Grant played in the 1940s ordered by year are:

,title,year,name,type,character,n
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [99]:
print("The number of roles available for actors in 1950s are:")
print(len(cast[(cast['year']>=1950)&(cast['year']<=1959)&(cast['type']=='actor')].type))

The number of roles available for actors in 1950s are:
66653

### How many roles were available for actresses in the 1950s?

In [100]:
print("The number of roles available for actresses in 1950s are:")
print(len(cast[(cast['year']>=1950)&(cast['year']<=1959)&(cast['type']=='actress')].type))

The number of roles available for actresses in 1950s are:
0

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [101]:
print("The number of leading roles available from the beginning of film history through 1980 are:")
print(len(cast[(cast['year']<=1980)&(cast['n']==1)].type))

The number of leading roles available from the beginning of film history through 1980 are:
18588

### How many non-leading roles were available through from the beginning of film history through 1980?

In [102]:
print("The number of non-leading roles available from the beginning of film history through 1980 are:")
print(len(cast[(cast['year']<=1980)&(cast['n']!=1)].type))

The number of non-leading roles available from the beginning of film history through 1980 are:
346128

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [103]:
print("The number of roles through 1980 that were minor enough and did not warrant a numeric n rank are:")
print(len(cast[(cast['year']==1980)&(cast['n'].isnull()==True)]))

The number of roles through 1980 that were minor enough and did not warrant a numeric n rank are:
1251